[
  {
    "slug": "adventures-in-accessibility",
    "title": "Adventures in Accessibility",
    "tags": "Semantic HTML, Vanilla JS, React",
    "date": "March 2020",
    "overviewtldr": "<h3>TL;DR</h3><p>An ongoing personal project to solidify my web accessibility knowledge by building core UI components that fulfil accessibility standards. I build these first in HTML & ES6,  then again in React.</p><h3>Results:</h3><ul><li><a href='/blog/accessible-accordion/' target='_blank'>Accessible Accordion</a></li><li><a href='/blog/accessible-custom-radio-buttons/' target='_blank'>Accessible, Custom-styled Radio Buttons</a></li><li><a href='/blog/accessible-custom-file-upload--v1/' target='_blank'>Accessible, Custom-styled File Upload</a></li></ul>",
    "overview": "<p>Working in web development, I am continually struck by how much of the web is built on a handful of key components.</p><p> Beneath every beautiful designed site or application lies the building blocks of the web - file inputs, radio buttons, checkboxes, accordions, and more.</p><p>I wanted to take a step back and ensure I really understood the accessibility implications of these unsung heroes.</p><p>This project is my opportunity to solidify best accessibility practice, as I build a collection of components - first in HTML & Vanilla JS, then again in React.",
    "ux": "<p>The components were developed in isolation, without a specific user-group in mind. The objective was to create a solid, accessible baseline from which the components could be adapted and evolved as required.</p><p>Consequently, the colours adopted were either related to other personal projects, or arbitrarily chosen. The colour combinations selected all meet the WCAG Level AAA contrast ratio.</p>",
    "a11y": "<p>I created a list of requirements the components needed to meet (and that I had the resources to test). This list was adapted from the published advice of accessibility experts and standards groups.</p><p> I do not pretend to have met all user cases, and the initial testing was conducted by myself, using built-in Android and Mac accessibility tooling.</p><p><strong>This is not, and is not intended to act as, a replacement for diverse user testing.</strong></p>",
    "result": "<p>Each component is hosted on CodeSandBox, and has been written up individually as a series of blog posts. Please click the component that interests you from the list below:</p><ul><li><a href='/blog/accessible-accordion/' target='_blank'>Accessible Accordion</a></li><li><a href='/blog/accessible-custom-radio-buttons/' target='_blank'>Accessible, Custom-styled Radio Buttons</a></li><li><a href='/blog/accessible-custom-file-upload--v1/' target='_blank'>Accessible, Custom-styled File Upload</a></li></ul>"
  },
  {
    "slug": "nihongo-scotland",
    "title": "Nihongo Scotland",
    "tags": "React, Styled Components, SCSS, Gatsby, Prismic",
    "date": "December 2020",
    "overviewtldr": "<h3>TL;DR</h3><p>A ongoing side-project for a Japanese language study-group in Edinburgh. Built with Prismic, Gatsby, React, and Styled Components.</p><h3>Results:</h3><ul><li><a href='https://nihongoscotland.netlify.com/' target='_blank'>WIP site</a></li></ul>",
    "overview": "<p>Nihongo Scotland is a Japanese language club in Edinburgh, Scotland. The club offers Japanese students the opportunity to practice their conversation skills, in-person, with native speakers.</p><p>The primary offering, 'Friday Night Study Club', is a casual, drop-in, donation-based session. The club also offers paid 'bootcamps' - intensive weekend courses, providing complete Japanese-language immersion. </p><p>The goal of this project was a holistic overhaul their online presence, beginning with branding, content strategy, and the Nihongo Scotland website.</p>",
    "ux": "<div class='case-study-content'> <div class='case-study-info'> <p> <b><u>Process:</u></b></p><ul> <li>Brand Workshop</li><li>User Interviews</li><li>Remote User Testing</li></ul> <br><p> <b><u>User Interview Results:</u></b></p><p>Semi-structured Interviews with existing club members informed the design as below:</p><ul> <li>Copy must be kept to a reading grade suitable for non-native English speakers</li><li>The website will be a brochure site, providing club time, location, and information. There is no current need to provide an online equivalent of the offline experience.</li><li>Bootcamp content is important - a large number of members found the page via their interest in / attendance at the Bootcamps</li></ul> </div> </div><div class='case-study-content'> <div class='case-study-info'> <p> <br><b><u>User Testing Results</u></b> <p>Remote mobile testing was conducted via <a href='https://www.trymyui.com' target='_blank'>TryMyUI.com</a>. 5 users who had an interest in, or some experience of, learning Japanese, performed initial impression testing, and worked through a handful of tasks.</p><p>Testing revealed:</p><ul> <li>Large logo on mobile prevents immediate comprehension of site services</li><li>Not immediately clear where the classes are held</li><li>Confusion around top-left 'home' button</li><li>Need for images</li><li>Need for testimonials on homepage</li></ul> </div><div class='case-study-info case-study-desktop-image'> <br><p><b><u>Wireframe refined after 1st round of user testing:</u></b></p><img src='https://i.ibb.co/wMkfHNh/Screenshot-2020-05-07-at-15-06-08.png' alt='wireframe restructured to take user testing results into account. The site title is added to the header bar, to act as a more prominent home link than the logo alone.The hero image is removed. Covid-19 messaging about classes moving online is made prominent.'></div></div>",
    "a11y": "<p>I created a list of requirements that I wanted the components to meet, and that I had the resources to test. This list was adapted from the published advice of accessibility experts and standards groups.</p><p>Initial testing was conducted by myself, using built-in Android and Mac accessibility tooling</p><p> <strong>This is not, and is not intended to act as, a replacement for diverse user testing.</strong></p>",
    "result": "<p>The basic layout was created with an emphasis on reusable, decoupled components. Margins were managed through an isolated spacing component to further enhance the reusability of each component.</p><p>User testing will continue at regular intervals as the design, layout, and content are continually refined.</p><p>Performance requires further optimisation.</p><p>Images and reviews will be added when available. </p><br><ul><li><a href='https://nihongoscotland.netlify.com/' target='_blank'>Work in Progress site V1</a></li><li><a href='https://github.com/emma-boardman/nc-gatsby' target='_blank'>GitHub Repo</a></li></ul>"
  },
  {
    "slug": "react-vue-comparison",
    "title": "Vue vs React Comparison",
    "tags": "React, Redux, Vue, Vuex, SQL, PHP",
    "date": "August 2019",
    "overviewtldr": "<h3>TL;DR</h3><p>An MSc dissertation project from August 2019, comparing React & Vue performance in the context of modifiability and adaptability<h3>Results:</h3><ul><li><a href='https://github.com/emma-boardman/react-pm-tool' target='_blank'>React project GitHub</a></li><li><a href='https://github.com/emma-boardman/vue-pm-tool' target='_blank'>Vue project GitHub</a></li></ul>",
    "overview": "<p>A comparative evaluation of the maintainability, extendability and scalability of React.js and Vue.js.</p><p>Requirements change, and as such code change, is inevitable. The aim of this project is to critically evaluate React.js and Vue.js for their extendability, maintainability, and scalability, by first implementing a Minimum Viable Product (MVP) using each framework, and subsequently introducing change requests.</p><p>The MVP for both applications will be developed to an identical design and requirements specification, to ensure a fair baseline for the subsequent evaluation. A full set of metrics will be run on the respective MVPs to serve as a baseline for the comparison. The metrics will then be rerun once both applications have been extended.</p><p>The application built was intended for use as a Project Management (PM) tool for a web development agency, who do not feel their use cases are met by existing PM tools.</p> ",
    "ux": "<div class='case-study-content'><div class='case-study-info'><p> <b><u>Process:</u></b><ul><li>Competitor audit</li><li>User Interviews</li><li>Contextual Inquiry</li><li>Personas</li><li>Customer Journeys</li><li>Paper Prototypes</li><li>User Testing</li></ul> <br><p> <b><u>Initial Research Results:</u></b></p><p>Interviews and contextual inquiry uncovered that the project management problem the company was facing was not really a tooling problem. The problem lay more in workplace culture, process, client education, and transparency around resource allocation.</p></div><div class='case-study-info case-study-desktop-image'><p><b><u>Stakeholder Needs:</u></b></p> <img src='https://i.ibb.co/d0mPxtC/case-study-js-needs.png' alt='stakeholders for pm tool'></div></div><div class='case-study-content'><div class='case-study-info'><p> <br> <b><u>Ideation</u></b><p>A solution was scoped that included:<ul><li>Structured ticket creation interface for clients, written to a non-technical reading grade. <br><span class='muted'>This is intended to improve the issue documenting process and ensure that all information is provided without an extensive back-and-forth.</span></li><li>Calendar View to display tasks per resource <br><span class='muted'>This is intended to improve transparency for management, and for team members to create a more connected culture</span></li><li>Reusable ticket types for tasks with common checklists <br><span class='muted'>This is intended to nurture process and support the continuous flow of contract workers</span></li></ul></div><div class='case-study-info case-study-desktop-image'> <br><p><b><u>Experience Map Snippet (PM persona):</u></b></p> <img src='https://i.ibb.co/FhWkjPM/case-study-js-experience.png' alt='stage 1 of experience map for PM persona'></div></div>",
    "a11y": "<p>The project was not originally built with an under-pinning of accessibility knowledge. Future rework would aim to fulfil the following base-level criteria:</p>",
    "result": "<ul><li><a href='https://github.com/emma-boardman/react-pm-tool' target='_blank'>React project GitHub</a></li><li><a href='https://github.com/emma-boardman/vue-pm-tool' target='_blank'>Vue project GitHub</a></li></ul>"
  },
  {
    "slug": "london-on-a-shoestring",
    "title": "London on a ShoeString",
    "tags": "Vue, Vuex, TypeScript",
    "date": "August 2019",
    "overviewtldr": "<h3>TL;DR</h3> <p>A mobile-first responsive web application built using VueJS and TypeScript, pulling data from the <a href='https://public-api.livingsocial.co.uk' target='_blank'>Living Social public API</a> and including 2 random generation functions.</p><h3>Results:</h3> <ul> <li><a href='https://emma-public-api-project.netlify.com' target='_blank'>London on a ShoeString Site</a></li><li><a href='https://github.com/emma-boardman/public-api-project' target='_blank'>London on a ShoeString GitHub</a></li></ul>",
    "overview": " <p>Living in a new city is an enriching experience, but a limited budget can put limitations on how much you can explore. </p><p>When I did my Japanese translation fellowship with the United Nations in Geneva, I was so terrified of how much anything cost that I ended up barely seeing or experiencing anything.</p><p>The idea for this applications is to pull coupons and deals for London, to show how someone on a limited budget might still be able to make the most of everything the city has to offer.</p><p>Think Groupon, but simplified - the top 10 best deals for that day, and a random deal selector for when even browsing 10 options feels like too much cognitive load. No more choice paralysis. 'London on a ShoeString'. </p>",
    "ux": " <div class='case-study-content'> <div class='case-study-info'> <p> Time-constraints meant that a lean UX approach was undertaken. The problem the site was intended to solve is the cognitive overload and dark UX patterns (playing on scarcity to invoke urgency in the user) observed on current deal sites.</p><p>The solution was a stripped-down, fun, bold, and simple to comprehend list of the top ten current deals.</p><p>The proto-persona was envisioned as someone young, not wishing to scroll through endless options, but just be presented quickly with top options for the days and weeks ahead. </p></div><div class='case-study-info case-study-desktop-image'><p><b><u>User Flow for Key Routes:</u></b></p><br><img src='https://i.ibb.co/jzKFRLZ/ls-user-flow-ia-sm.png' alt='simplified user flow' id='ls-user-ia'><br></div></div>",
    "a11y": " <p>The project was not originally built with an under-pinning of accessibility knowledge. Future rework would aim to fulfil the following base-level criteria:</p>",
    "result": "<ul><li><a href='https://emma-public-api-project.netlify.com' target='_blank'>London on a ShoeString Site</a></li><li><a href='https://github.com/emma-boardman/public-api-project' target='_blank'>London on a ShoeString GitHub</a></li></ul>"
  }
]
