[
  {
    "slug" : "adventures-in-accessibility",
    "title": "Adventures in Accessibility",
    "overviewtldr": "<h3>TL;DR</h3><p>An ongoing personal project to solidify my web accessibility knowledge by building core UI components that fulfil accessibility standards. I build these first in HTML & ES6,  then rebuilding them using React.</p><h3>Results:</h3><ul><li><a href='/blog/accessible-accordion/' target='_blank'>Accessible Accordion</a></li><li><a href='/blog/accessible-custom-radio-buttons/' target='_blank'>Accessible, Custom-styled Radio Buttons</a></li></ul>",
    "overview": "<p>Working in web development, I am continually struck by how much of the web is built on a handful of key components.</p><p> Beneath every beautiful designed site or application lies the building blocks of the web - file inputs, radio buttons, checkboxes, accordions, and more.</p><p>I wanted to take a step back and ensure I really understood the accessibility implications of these unsung heroes.</p><p>This project is my opportunity to solidify best accessibility practice, as I build a collection of components - first in HTML & Vanilla JS, then again in React.",
    "ux": "<p>The components were developed in isolation, without a specific user-group in mind. Depending on the use-case, the user needs for the design or interactivity are likely to vary. The key considerations here were to create a solid, accessible baseline from which the components could be adapted and evolved as required.</p><p>Consequently, the design and styled adopted were based on colour palettes I found in daily life which appealed to me or matched particular projects I was working on, and which met colour contrast requirements.</p>",
    "a11y": "<p>I created a list of requirements that I wanted the components to meet, and that I had the resources to test. This list was adapted from the published advice of accessibility experts and standards groups.  I do not pretend to have met all user cases, and my testing is <strong>me</strong>, with a MAC screen reader. <strong>This is not, and is not intended to act as, a replacement for diverse user testing.</strong></p>",
    "result": "<p>Each component is hosted on CodeSandBox, and has been written up individually as a series of blog posts. Please click the component that interests you from the list below:</p><ul><li><a href='/blog/accessible-accordion/' target='_blank'>Accessible Accordion</a></li><li><a href='blog/accessible-custom-radio-buttons/' target='_blank'>Accessible, Custom-styled Radio Buttons</a></li></ul>"
  },
  {
    "slug" : "nihongo-scotland",
    "title": "Nihongo Scotland",
    "overviewtldr": "<h3>TL;DR</h3><p>A side-project for a Japanese language study-group in Edinburgh. Built with Prismic, Gatsby, React, and Styled Components.</p><h3>Results:</h3><ul><li><a href='https://nihongoscotland.netlify.com/' target='_blank'>WIP site</a></li></ul>",
    "overview": "<p>Nihongo Scotland is a Japanese language club in Edinburgh, Scotland. The club offers Japanese students the opportunity to practice their conversation skills, in-person, with native speakers. The primary offering, 'Friday Night Study Club', is a casual, drop-in, donation-based session. The club also offers paid 'bootcamps' - intensive weekend courses, providing complete Japanese-language immersion. </p>",
    "ux": "<p>User Research began with 1:1 semi-structured interviews with club members. Talking to users made it clear that the online presence simply acted as a digital signpost for the club - the allure of Nihongo Scotland is the opportunity to converse in-person with native speakers. </p><p>User Interview Results:</p><ul><li>Copy should be kept to a reading level suitable for non-native English speakers</li><li>The website should act as a brochure site, providing club time, location, and information. There is no current need to provide an online equivalent of the offline experience.</li><li>Bootcamp content is important - a large number of members found the page via their interest in / attendance at the Bootcamps</li></ul>",
    "a11y": "<p>I created a list of requirements that I wanted the components to meet, and that I had the resources to test. This list was adapted from the published advice of accessibility experts and standards groups.  I do not pretend to have met all user cases, and my testing is <strong>me</strong>, with a MAC screen reader. <strong>This is not, and is not intended to act as, a replacement for diverse user testing.</strong></p>",
    "result": "<p>The basic layout was created with an emphasis on reusable, decoupled components. Margins were managed through an isolated spacing component to further enhance the reusability of each component.</p><p>The next step is User Testing. This will be conducted remotely using an online service due to current social distancing measures in the UK.</p><p>The Work In Progress site can be viewed <a href='https://nihongoscotland.netlify.com/' target='_blank'>here</a></p><p>The GitHub repo can be viewed <a href='emmaboardman1986/nc-gatsby' target='_blank'>here</a></p>"
  }
]
