[
  {
    "slug" : "adventures-in-accessibility",
    "title": "Adventures in Accessibility",
    "overviewtldr": "<h3>TL;DR</h3><p>A personal project to solidify my web accessibility knowledge by building core UI components that fulfil accessibility standards. I build these first in HTML & ES6,  then rebuilding them using React.</p><h3>Results:</h3><ul><li><a href='https://codesandbox.io/s/accessible-accordion-vanilla-6sk0w' target='_blank'>HTML & ES6 CodeSandbox</a></li><li><a href='https://codesandbox.io/s/react-accordion-using-react-hooks-9uuvc' target='_blank'>React CodeSandbox</a></li>",
    "overview": "<p>Working in web development, I am continually struck by how much of the web is built on a handful of key components.</p><p> Beneath every beautiful designed site or application lies the building blocks of the web - file inputs, radio buttons, checkboxes, accordions, and more.</p><p>I wanted to take a step back and ensure I really understood the accessibility implications of these unsung heroes.</p><p>This project is my opportunity to solidify best accessibility practice, as I build a collection of components - first in HTML & Vanilla JS, then again in React.",
    "ux": "<p>The components were developed in isolation, without a specific user-group in mind. Depending on the use-case, the user needs for the design or interactivity are likely to vary. The key considerations here were to create a solid, accessible baseline from which the components could be adapted and evolved as required.</p><p>Consequently, the design and styled adopted were based on colour palettes I found in daily life which appealed to me or matched particular projects I was working on, and which met colour contrast requirements.</p>",
    "a11y": "<p>I created a list of requirements that I wanted the components to meet, and that I had the resources to test. This list was adapted from the published advice of accessibility experts and standards groups.  I do not pretend to have met all user cases, and my testing is *me*, with a MAC screen reader. **This is not, and is not intended to act as, a replacement for diverse user testing.**</p>",
    "result": "<p>Each component is hosted on CodeSandBox has been written up individually as a series of blog posts, which include the CodeSandBox embeds. Please click the component that interests you from the list below:</p>"
  }
]
